# Pandas

<div class="alert alert-info" style="margin: 20px">
                                     
* <font color= red> Data structures: </font>   
    Series: a one-dimensional labeled array ,<font color = green> it can be seen as an upgraded ndarray</font>    
    DataFrame: two-dimensional labeled data structure with columns ,<font color = green> it can be seen as an upgraded series</font>  
* <font color= red> Labeling: </font>  
    index: the name of each row  
    column name: the name of each column

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
# enable interactiveShell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# 1. Series
##### Series( data=None, index=None, dtype=None, name=None, copy=False, fastpath=False )

two ways to create a Series
* you can create a list by passing a 1-D array, by adding or or define index
* you can also create by passing a dictionary

### 1.1 Basic syntax

In [14]:
# String
S=pd.Series(['1','2','3','4','5'])
S
S.values
S.index
S[0]+S[1]

0    1
1    2
2    3
3    4
4    5
dtype: object

array(['1', '2', '3', '4', '5'], dtype=object)

RangeIndex(start=0, stop=5, step=1)

'12'

In [16]:
# Interger in list
S = Series([1, 2, 3, 4, 5])
S
S.values
S.index
S[0]+S[1]

0    1
1    2
2    3
3    4
4    5
dtype: int64

array([1, 2, 3, 4, 5])

RangeIndex(start=0, stop=5, step=1)

3

In [17]:
# Boolean in list
S = Series([True, False, False,True,True])
S
S.values
S.index
S[0]+S[1]

0     True
1    False
2    False
3     True
4     True
dtype: bool

array([ True, False, False,  True,  True])

RangeIndex(start=0, stop=5, step=1)

True

In [21]:
# Float in tuple
S = Series(data  = (1.2,2.3,3.4,4.5,5.6))
S
S.values
S.index
S[0]+S[1]

0    1.2
1    2.3
2    3.4
3    4.5
4    5.6
dtype: float64

array([1.2, 2.3, 3.4, 4.5, 5.6])

RangeIndex(start=0, stop=5, step=1)

3.5

In [23]:
# Float in dictionary
S = Series(data  = {1:1.2,2:2.2,3:3.3,4:4.4,5:5.5})
S
S.values
S.index
S[0] + S[1] # beacuse we didn't assign S[0]

1    1.2
2    2.2
3    3.3
4    4.4
5    5.5
dtype: float64

array([1.2, 2.2, 3.3, 4.4, 5.5])

Int64Index([1, 2, 3, 4, 5], dtype='int64')

KeyError: 0

### 1.2 Series operation

#### 1.2.1  Series with number

In [12]:
S = Series([4, 7, -5, 3, None], index=['d', 'b', 'a', 'c','f'])
S

d    4.0
b    7.0
a   -5.0
c    3.0
f    NaN
dtype: float64

In [13]:
S * 2

d     8.0
b    14.0
a   -10.0
c     6.0
f     NaN
dtype: float64

In [14]:

S+10
S.add(10)
S.add(10, fill_value = 0)
S.add(10, fill_value = 100)

d    14.0
b    17.0
a     5.0
c    13.0
f     NaN
dtype: float64

d    14.0
b    17.0
a     5.0
c    13.0
f     NaN
dtype: float64

d    14.0
b    17.0
a     5.0
c    13.0
f    10.0
dtype: float64

d     14.0
b     17.0
a      5.0
c     13.0
f    110.0
dtype: float64

In [15]:
# Series is an upgraded version of ndarray
S = Series([1,2,3,4,None,np.nan])
S
None == np.nan # None type data is different with np.nan
S.sum()


ND = np.array([1,2,3,4,None,np.nan])
ND.sum() # none type data can not be sumed

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    NaN
dtype: float64

False

10.0

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

#### 1.2.2. Series with Series


   <font color = green> * when calculating between two series, it automaticlly pair similar index, and only calculate the matched part</font>  
   <font color = green>  * it will concatenate all index with unpaired part return NaN.</font>

In [18]:
student = {'Student1': 99, 'Student2': 100, 'Student3': 20, 'Student4': np.NaN}
S = Series(student)
S

# you can copy value from S to S2 by retreiving index
index = ['Student1', 'Student2', 'Student3']
S2 = Series(student, index= index)
S2

# series addation
S + S2

Student1     99.0
Student2    100.0
Student3     20.0
Student4      NaN
dtype: float64

Student1     99.0
Student2    100.0
Student3     20.0
dtype: float64

Student1    198.0
Student2    200.0
Student3     40.0
Student4      NaN
dtype: float64

In [21]:
S1 = Series([1,2,3,4,5],index = [0,1,2,3,4])
S1
S2 = Series([11,22,33,44,55], index = [3,4,5,6,7])
S2

S1+S2

# if you want to retain all values in a Series, you can use add()
S1.add(S2, fill_value = 0)

0    1
1    2
2    3
3    4
4    5
dtype: int64

3    11
4    22
5    33
6    44
7    55
dtype: int64

0     NaN
1     NaN
2     NaN
3    15.0
4    27.0
5     NaN
6     NaN
7     NaN
dtype: float64

0     1.0
1     2.0
2     3.0
3    15.0
4    27.0
5    33.0
6    44.0
7    55.0
dtype: float64

### 1.3 Null values

* `NaN` values numpy uses `np.isnan()`.

* `NaN` values pandas uses either .isna() or .isnull().

The NaN values are inherited from the fact that pandas is built on top of numpy

In [118]:
# Series and dataframe share the same attribute
Series.isnull(S)
Series.isna(S)

pd.isnull(S)
pd.isna(S)

# build in function
S.isnull()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

### 1.4 Seies indexing / sclicing

there are three types of indexing:
1. sclicing:
    - S[ start:end:step, start:end:step]
    - same as indexing as NumPy ndaray
2. visible indexing:
    - `.loc[]`
    - using index itself as searching pattern
    
3. invisible indexing:
    - `.iloc[]`
    - using cardinal number of an indexas searching pattern
    
    
* <font color = red> since compare to orther data structure series index is an essential attribute, here we recommend using visible indexing `.loc[ ]`.</font>

In [129]:
dic = {'A':1,'B':2,'C':3,'D':4,'E':5} 
S = pd.Series(dic) # Now characters are index and numbers are value
S
S.index

A    1
B    2
C    3
D    4
E    5
dtype: int64

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

#### 1.4.1 quick slicing

In [130]:
# quick slicing 
S.head()
S.tail()

A    1
B    2
C    3
D    4
E    5
dtype: int64

A    1
B    2
C    3
D    4
E    5
dtype: int64

#### 1.4.2 slicinng

In [131]:
# slicinng
S[1]

2

#### 1.4.3 .loc[ ]

In [132]:
# loc
S.loc['A']
S.loc[1] # if you pass a value in it it will raice a error

1

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [1] of <class 'int'>

#### 1.4.4 .iloc[  ]

In [133]:
# iloc
S.iloc[1]
S.iloc['A'] # If you pass index itself, it will raise a error

2

TypeError: cannot do positional indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [A] of <class 'str'>

#### 1.4.5 Boolean indexing

In [134]:
# Boolean indexing
s1 = Series([1,2,3,4,np.nan,None,7,8,9])
s1
s2 = s1.isnull()
s2
s3 = Series(['A','B','C','D','E','F','G','H','I'])
s3
s3[s2]

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    NaN
6    7.0
7    8.0
8    9.0
dtype: float64

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
8    False
dtype: bool

0    A
1    B
2    C
3    D
4    E
5    F
6    G
7    H
8    I
dtype: object

4    E
5    F
dtype: object

#### 1.4.6 Interval Difference

In [ ]:
# interval 
S.loc['A':'B'] # inclusive : inclusive
S.iloc[0:1] # inclusive : exclusive

#### 1.4.7 Hierarchical indexing

In [214]:
S = Series([17,20000,27,12000],
           index = [['car1','car1','car2','car2'],['mpg','price','mpg','price']])
S

car1  mpg         17
      price    20000
car2  mpg         27
      price    12000
dtype: int64

In [224]:
S['car1']['mpg']
S['car1','mpg'] #same

S[['car2','car1']]

17

17

car1  mpg         17
      price    20000
car2  mpg         27
      price    12000
dtype: int64

In [248]:
S.iloc[0:3]  # alougth it is a multi index, implicit indexing seeing it as a simple indexing

car1  mpg         17
      price    20000
car2  mpg         27
dtype: int64

# 2. DataFrame

* DataFrame is an upgraded version of Series, it can be seen as multiple Series sharing same index
* DataFrame also expend Series from 1 dimension to multiple dimension
    - row index: index
    - column index: column
    - cell : values

### 2.1 Basic Syntax

In [157]:
# many ways to create a DataFrame
df = pd.DataFrame(np.random.randint(60,100, (5,4)), \
                  index=[1,2,3,4,5], \
                  columns=['A','B','C','D'])
df


dic = {'column1':[1,2,3,4,5],'column2':[11,22,33,44,55],'column3':[111,222,333,444,555]}
df1 = DataFrame(dic,index = ('row0','row1','row2','row3','row4'))
df1


dic2 = {'column1':{1999:1,2000:2,2001:3},'column2':{1999:5,2000:101,2001:231},'column3':{1998:5123,2002:123,2004:435}}
df2 = DataFrame(dic2)
df2

    A   B   C   D
1  80  62  96  70
2  82  93  65  89
3  63  84  71  69
4  98  62  71  71
5  65  79  88  79

      column1  column2  column3
row0        1       11      111
row1        2       22      222
row2        3       33      333
row3        4       44      444
row4        5       55      555

      column1  column2  column3
1998      NaN      NaN   5123.0
1999      1.0      5.0      NaN
2000      2.0    101.0      NaN
2001      3.0    231.0      NaN
2002      NaN      NaN    123.0
2004      NaN      NaN    435.0

In [23]:
df.index
df.columns
df.values

Int64Index([1, 2, 3, 4, 5], dtype='int64')

Index(['A', 'B', 'C', 'D'], dtype='object')

array([[68, 75, 82, 96],
       [80, 64, 90, 99],
       [68, 60, 79, 87],
       [90, 62, 65, 85],
       [87, 71, 74, 92]])

In [25]:
df.values.shape

(5, 4)

In [24]:
# get first fiive rows
df.head(5)

# get last three rows
df.tail(3)

# get a column 
df.A  # OR df['A']
df['A']


# columns are Series
type(df.A)

    A   B   C   D
1  68  75  82  96
2  80  64  90  99
3  68  60  79  87
4  90  62  65  85
5  87  71  74  92

    A   B   C   D
3  68  60  79  87
4  90  62  65  85
5  87  71  74  92

1    68
2    80
3    68
4    90
5    87
Name: A, dtype: int64

1    68
2    80
3    68
4    90
5    87
Name: A, dtype: int64

pandas.core.series.Series

In [3]:
# you can also define a Dataframe by using dictionary
df = DataFrame({'height':[6.6,5.5,6.3,6.8],\
                'age':[22,24,25,26],\
                'bodyfat':[0.4,0.2,0.25,0.3]}, 
               index = ['person1','person2','person3','person4'],
               # columns = ['h','a',b']
              )
df

         height  age  bodyfat
person1     6.6   22     0.40
person2     5.5   24     0.20
person3     6.3   25     0.25
person4     6.8   26     0.30

In [4]:
# you can enlarge the dataset by adding new index and values
df["DEPT"]=['CS','BIA','IS','BIA']
df

         height  age  bodyfat DEPT
person1     6.6   22     0.40   CS
person2     5.5   24     0.20  BIA
person3     6.3   25     0.25   IS
person4     6.8   26     0.30  BIA

### 2.2 DataFrame Indexing

* list of strings  
      return all those columns as a DataFrame, e.g. df[['A','B']]
    
    
      
* a sliceselect rows (can do both label and integer location  
      confusing!), e.g. df.loc or df.iloc
    
      
* a sequence of booleans  
      select all rows where True, e.g. df[(df.A>70) & (df.DEPT=='CS')]

In [49]:
age = df['age']
age
type(age) # each column is a series
age.index # and the index also embeded with each column(series)

person1    22
person2    24
person3    25
person4    26
Name: age, dtype: int64

pandas.core.series.Series

Index(['person1', 'person2', 'person3', 'person4'], dtype='object')

### 2.2.1 column indexing
- since each column is a series, it can be indexed, although each row has an index, it is not a series and means nothing (not an attribute)  
- column can not be sliced

In [54]:
# columnn wise
df.age
df['age']

# row wise
df.person1
df['person1']

person1    22
person2    24
person3    25
person4    26
Name: age, dtype: int64

person1    22
person2    24
person3    25
person4    26
Name: age, dtype: int64

AttributeError: 'DataFrame' object has no attribute 'person1'

### 2.2.2 row indexing

same as Series, DataFrame are able to be indexed by the following three types:  

- .ix[ ]  (is deprecated in python3, not recommend for future use)
- .loc[ ]    explict indexing
- .iloc[ ]    implict indexing
- <font color = red> number slicing alone is not supportted by DataFrame( df[row_start : row_stop, col_start: col_stop] )</font>

In [91]:
df[1:4,:] # slicing will raise an error

TypeError: unhashable type: 'slice'

In [92]:
df['person1':'person4'] # index sclicing canbe used

         height  age  bodyfat DEPT
person1     6.6   22     0.40   CS
person2     5.5   24     0.20  BIA
person3     6.3   25     0.25   IS
person4     6.8   26     0.30  BIA

#### 2.2.2.1 .ix[  ]

In [68]:
df.ix[1]

# indexing followed by indexinng
df.ix[1][2]

# single indexing
df.ix[1,2]

/Users/shanjiang/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

height     5.5
age         24
bodyfat    0.2
DEPT       BIA
Name: person2, dtype: object

/Users/shanjiang/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

0.2

/Users/shanjiang/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  import sys

0.2

In [74]:
row_1 = df.ix[1]
type(row_1) # it is also a Series (transposed a row into a Series, with column name as their index )

/Users/shanjiang/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

pandas.core.series.Series

#### 2.2.2.2 .loc[    ]

In [79]:
# .loc[ ]
# same as series, using index itself as searching pattern
df.loc['person1']
row_person1=df.loc['person1']
type(row_person1)

height     6.6
age         22
bodyfat    0.4
DEPT        CS
Name: person1, dtype: object

pandas.core.series.Series

In [87]:
# by using [ ] to adding multiple searching pattern

df.loc[['person1','person2']] # [] added both person1 and person2 and it returns a DataFrom not a Series


df.loc['person1','person2']

         height  age  bodyfat DEPT
person1     6.6   22      0.4   CS
person2     5.5   24      0.2  BIA

KeyError: 'the label [person2] is not in the [index]'

In [89]:
# loc also can be used for slicing
df.loc['person1':'person4'] # inclusive

         height  age  bodyfat DEPT
person1     6.6   22     0.40   CS
person2     5.5   24     0.20  BIA
person3     6.3   25     0.25   IS
person4     6.8   26     0.30  BIA

In [7]:
# loc is unable to give a column slicing

df.loc['heigth':'bodyfat'] 
df.loc['whatever':'whatsoever']

# this means it always reading as rows, and it returns 0 of rows.

Empty DataFrame
Columns: [height, age, bodyfat, DEPT]
Index: []

Empty DataFrame
Columns: [height, age, bodyfat, DEPT]
Index: []

#### 2.2.2.3 .iloc[  ]   implict indexing

In [97]:
df.iloc[0]

height     6.6
age         22
bodyfat    0.4
DEPT        CS
Name: person1, dtype: object

In [95]:
df.iloc[0:5] # exclusive

         height  age  bodyfat DEPT
person1     6.6   22     0.40   CS
person2     5.5   24     0.20  BIA
person3     6.3   25     0.25   IS
person4     6.8   26     0.30  BIA

### 2.2.3 Element Indexing

In [12]:
df['bodyfat'] # now it becomes a Series

# column indexing then row indexing
df['bodyfat']['person1']

# row indexing then column indexing
df.loc['person1']['bodyfat']

# [row,column]
df.loc['person1','bodyfat']

# values indexing
df.values[0,2] # it now can be seen as a 2D matrix


# when you implement row indexing, we can put many parameters
# when you implement column indexing, you can only put one parameters

person1    0.40
person2    0.20
person3    0.25
person4    0.30
Name: bodyfat, dtype: float64

0.4

0.4

0.4

0.4

### 2.2.4 Hierarchical indexing

#### 2.2.4.1 Creating an Hierarchical indexing

In [240]:
# Naive way creatig MultiIndex
df = DataFrame(np.arange(12).reshape((6, 2)),
                   index=[['Google', 'Google','Google','Facebook','Facebook','Facebook'],
                          [2000, 2001, 2002, 2000, 2001, 2002]],
                   columns=['event1', 'event2'])
df
df.index

               event1  event2
Google   2000       0       1
         2001       2       3
         2002       4       5
Facebook 2000       6       7
         2001       8       9
         2002      10      11

MultiIndex(levels=[['Facebook', 'Google'], [2000, 2001, 2002]],
           labels=[[1, 1, 1, 0, 0, 0], [0, 1, 2, 0, 1, 2]])

In [241]:
# Create by arrays
df1 = DataFrame(data = np.random.randint(0,150,size = (6,4)),
               columns = ["Spring1",'Summer1','Spring2','Summer2'],
               index = pd.MultiIndex.from_arrays([['student1','student1','sudent2','sudent2','Michael','Michael'],
                                                  ['midterm','final','midterm','final','midterm','final']]))

df1
df1.index

                  Spring1  Summer1  Spring2  Summer2
student1 midterm       92       84       22       63
         final         42      131       66       15
sudent2  midterm       12       73      120       20
         final         94       64       22      101
Michael  midterm      134       33       65       15
         final        115      132      146       37

MultiIndex(levels=[['Michael', 'student1', 'sudent2'], ['final', 'midterm']],
           labels=[[1, 1, 2, 2, 0, 0], [1, 0, 1, 0, 1, 0]])

In [242]:
# Create by list tuples
df2 = DataFrame(data = np.random.randint(0,150,size = (6,4)),
               columns = ["Spring",'Summer','Autumn','Winter'],
               index = pd.MultiIndex.from_tuples([('student1','midterm'),('student1','final'),
                                                  ('sudent2','midterm'),('sudent2','final'),
                                                  ('Michael','midterm'),('Michael','final')]))

df2

df2.index

                  Spring  Summer  Autumn  Winter
student1 midterm      14      49      47      53
         final         2      48      91      97
sudent2  midterm     115      33     137      91
         final       136     114       2      96
Michael  midterm     134      78      39      85
         final       145     129       6      91

MultiIndex(levels=[['Michael', 'student1', 'sudent2'], ['final', 'midterm']],
           labels=[[1, 1, 2, 2, 0, 0], [1, 0, 1, 0, 1, 0]])

In [244]:
# Create by list product
df3 = DataFrame(data = np.random.randint(0,150,size = (6,4)),
               columns = ["Spring",'Summer','Autumn','Winter'],
               index = pd.MultiIndex.from_product([['student1','sudent2','Michael'],['midterm','final']]))

df3
df3.index

                  Spring  Summer  Autumn  Winter
student1 midterm     111      83      82      55
         final        95     146       9     135
sudent2  midterm     140      67      25      43
         final         4      39      31      67
Michael  midterm      16     118     115     142
         final        53      42      82      41

MultiIndex(levels=[['Michael', 'student1', 'sudent2'], ['final', 'midterm']],
           labels=[[1, 1, 2, 2, 0, 0], [1, 0, 1, 0, 1, 0]])

In [247]:
# column can also be created as MultiIndex
df4 = DataFrame(data = np.random.randint(0,150,size = (4,6)),
               index = ["Spring",'Summer','Autumn','Winter'],
               columns = pd.MultiIndex.from_product([['student1','sudent2','Michael'],['midterm','final']]))

df4
df4.index
df4.columns

       student1       sudent2       Michael
        midterm final midterm final midterm final
Spring       59    36     100   137     135    11
Summer      105     0     135    33      55    18
Autumn       84    93      95    86     132    28
Winter        5   146      18   107      36    84

Index(['Spring', 'Summer', 'Autumn', 'Winter'], dtype='object')

MultiIndex(levels=[['Michael', 'student1', 'sudent2'], ['final', 'midterm']],
           labels=[[1, 1, 2, 2, 0, 0], [1, 0, 1, 0, 1, 0]])

#### 2.2.4.2 Slicing

In [255]:
df5 = DataFrame(data = np.random.randint(0,150,size = (3,4)),
               columns = ["Spring",'Summer','Autumn','Winter'],
               index = ['student1','student2','Michael'])

df5
df3

df5['student1':'student2']
df3['student1':'student2'] # Raise an error

          Spring  Summer  Autumn  Winter
student1      86      65      87     141
student2     118     138      90     109
Michael      114      88     101      89

                  Spring  Summer  Autumn  Winter
student1 midterm     111      83      82      55
         final        95     146       9     135
sudent2  midterm     140      67      25      43
         final         4      39      31      67
Michael  midterm      16     118     115     142
         final        53      42      82      41

          Spring  Summer  Autumn  Winter
student1      86      65      87     141
student2     118     138      90     109

UnsortedIndexError: 'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [260]:
df3.index = pd.MultiIndex.from_product([list('ABC'),['midterm','final']])
df3
df3['A':'B'] # Now it is okay to use, this bug maybe because too many byte stored in the index layer

           Spring  Summer  Autumn  Winter
A midterm     111      83      82      55
  final        95     146       9     135
B midterm     140      67      25      43
  final         4      39      31      67
C midterm      16     118     115     142
  final        53      42      82      41

           Spring  Summer  Autumn  Winter
A midterm     111      83      82      55
  final        95     146       9     135
B midterm     140      67      25      43
  final         4      39      31      67

In [263]:
# Hence it is better to use iloc
df3.iloc[0:4]

           Spring  Summer  Autumn  Winter
A midterm     111      83      82      55
  final        95     146       9     135
B midterm     140      67      25      43
  final         4      39      31      67

### 2.3 DataFrame operator

In [99]:
dictionray = {'DOB':[1994,1995,1996,1997], 
              'address':['NJ','NY','NC','CA'],
              'phone':['123-333-222','999-222-3232','323-323-4141','567-235-9842'],
              'Dept':['CS','IS','BA','EE']}
dictionray

df = pd.DataFrame(dictionray, 
                  index = ['student1','student2','student3','student4'])
df

{'DOB': [1994, 1995, 1996, 1997],
 'address': ['NJ', 'NY', 'NC', 'CA'],
 'phone': ['123-333-222', '999-222-3232', '323-323-4141', '567-235-9842'],
 'Dept': ['CS', 'IS', 'BA', 'EE']}

           DOB address         phone Dept
student1  1994      NJ   123-333-222   CS
student2  1995      NY  999-222-3232   IS
student3  1996      NC  323-323-4141   BA
student4  1997      CA  567-235-9842   EE

#### 2.3.1 Deep copy vs shallow copy

In [101]:
df1 = df.copy(deep=True)
df1
df2 = df.copy(deep=False)
df2

           DOB address         phone Dept
student1  1994      NJ   123-333-222   CS
student2  1995      NY  999-222-3232   IS
student3  1996      NC  323-323-4141   BA
student4  1997      CA  567-235-9842   EE

           DOB address         phone Dept
student1  1994      NJ   123-333-222   CS
student2  1995      NY  999-222-3232   IS
student3  1996      NC  323-323-4141   BA
student4  1997      CA  567-235-9842   EE

In [104]:
# by doing this way, the value won't change
df.loc['student1']['DOB'] = 1993
df

# by doing this way, values are changed
df.loc['student1','DOB'] = 1993
df
#  the SettingWithCopyWarning was created to flag "chained assignment" operations

/Users/shanjiang/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

           DOB address         phone Dept
student1  1994      NJ   123-333-222   CS
student2  1995      NY  999-222-3232   IS
student3  1996      NC  323-323-4141   BA
student4  1997      CA  567-235-9842   EE

           DOB address         phone Dept
student1  1993      NJ   123-333-222   CS
student2  1995      NY  999-222-3232   IS
student3  1996      NC  323-323-4141   BA
student4  1997      CA  567-235-9842   EE

In [105]:
df
df1 # deep copy, with df changes df1 woon't change
df2 # shallow copy, with df changes df2 changes

           DOB address         phone Dept
student1  1993      NJ   123-333-222   CS
student2  1995      NY  999-222-3232   IS
student3  1996      NC  323-323-4141   BA
student4  1997      CA  567-235-9842   EE

           DOB address         phone Dept
student1  1994      NJ   123-333-222   CS
student2  1995      NY  999-222-3232   IS
student3  1996      NC  323-323-4141   BA
student4  1997      CA  567-235-9842   EE

           DOB address         phone Dept
student1  1993      NJ   123-333-222   CS
student2  1995      NY  999-222-3232   IS
student3  1996      NC  323-323-4141   BA
student4  1997      CA  567-235-9842   EE

#### 2.3.2 DataFrame operator

| Python Operator | Pandas Method(s)                      |
|:----------------|:--------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

In [111]:
# addation
df.DOB
df.DOB+1

student1    1993
student2    1995
student3    1996
student4    1997
Name: DOB, dtype: int64

student1    1994
student2    1996
student3    1997
student4    1998
Name: DOB, dtype: int64

In [107]:
df1.loc['new_student'] = ['1998','ND','019-283-6478','CPE']
df1

              DOB address         phone Dept
student1     1994      NJ   123-333-222   CS
student2     1995      NY  999-222-3232   IS
student3     1996      NC  323-323-4141   BA
student4     1997      CA  567-235-9842   EE
new_student  1998      ND  019-283-6478  CPE

In [109]:
df2

           DOB address         phone Dept
student1  1993      NJ   123-333-222   CS
student2  1995      NY  999-222-3232   IS
student3  1996      NC  323-323-4141   BA
student4  1997      CA  567-235-9842   EE

In [110]:
df1+df2

              DOB address                     phone  Dept
new_student   NaN     NaN                       NaN   NaN
student1     3987    NJNJ    123-333-222123-333-222  CSCS
student2     3990    NYNY  999-222-3232999-222-3232  ISIS
student3     3992    NCNC  323-323-4141323-323-4141  BABA
student4     3994    CACA  567-235-9842567-235-9842  EEEE

In [117]:
df1.add(df2,fill_value='')
df3 = df1.add(df2,fill_value='')

              DOB address                     phone  Dept
new_student  1998      ND              019-283-6478   CPE
student1     3987    NJNJ    123-333-222123-333-222  CSCS
student2     3990    NYNY  999-222-3232999-222-3232  ISIS
student3     3992    NCNC  323-323-4141323-323-4141  BABA
student4     3994    CACA  567-235-9842567-235-9842  EEEE

In [124]:
df4 = pd.DataFrame({'DOB':[1994,1995,1996,1997], 
              'address':['NJ','NY','NC','CA'],
              'phone':['123-333-222','999-222-3232','323-323-4141','567-235-9842']},
               index = ['person1','person2','person3','person4'])
df4 #shape = 4x3
df3 #shape = 5x4

          DOB address         phone
person1  1994      NJ   123-333-222
person2  1995      NY  999-222-3232
person3  1996      NC  323-323-4141
person4  1997      CA  567-235-9842

              DOB address                     phone  Dept
new_student  1998      ND              019-283-6478   CPE
student1     3987    NJNJ    123-333-222123-333-222  CSCS
student2     3990    NYNY  999-222-3232999-222-3232  ISIS
student3     3992    NCNC  323-323-4141323-323-4141  BABA
student4     3994    CACA  567-235-9842567-235-9842  EEEE

In [182]:
df3.add(df4) # created a full size DF

             DOB Dept address phone
new_student  NaN  NaN     NaN   NaN
person1      NaN  NaN     NaN   NaN
person2      NaN  NaN     NaN   NaN
person3      NaN  NaN     NaN   NaN
person4      NaN  NaN     NaN   NaN
student1     NaN  NaN     NaN   NaN
student2     NaN  NaN     NaN   NaN
student3     NaN  NaN     NaN   NaN
student4     NaN  NaN     NaN   NaN

In [137]:
s1 = df3['DOB'] # take the column 
s1
s2 = df3.loc['student1'] # take the row
s2

new_student    1998
student1       3987
student2       3990
student3       3992
student4       3994
Name: DOB, dtype: object

DOB                          3987
address                      NJNJ
phone      123-333-222123-333-222
Dept                         CSCS
Name: student1, dtype: object

In [142]:
df2 + s1

ValueError: operands could not be broadcast together with shapes (12,) (3,)

In [141]:
df2 + s2 # broadcast

           DOB address                               phone    Dept
student1  5980  NJNJNJ   123-333-222123-333-222123-333-222  CSCSCS
student2  5982  NYNJNJ  999-222-3232123-333-222123-333-222  ISCSCS
student3  5983  NCNJNJ  323-323-4141123-333-222123-333-222  BACSCS
student4  5984  CANJNJ  567-235-9842123-333-222123-333-222  EECSCS

### 2.4 DataFrame Manipulating

#### 2.4.1 Assigning

In [170]:
df4

          DOB address         phone
person1  1994      NJ   123-333-222
person2  1995      NY  999-222-3232
person3  1996      NC  323-323-4141
person4  1997      CA  567-235-9842

In [171]:
df4['West'] = df4['address']== 'CA'
df4

          DOB address         phone   West
person1  1994      NJ   123-333-222  False
person2  1995      NY  999-222-3232  False
person3  1996      NC  323-323-4141  False
person4  1997      CA  567-235-9842   True

In [172]:
del df4['West']
df4

          DOB address         phone
person1  1994      NJ   123-333-222
person2  1995      NY  999-222-3232
person3  1996      NC  323-323-4141
person4  1997      CA  567-235-9842

In [173]:
dic5 = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df5= DataFrame(dic5)
df5

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [174]:
df5.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [175]:
df5.index.name = 'year'; df5.columns.name = 'state'
df5

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

#### 2.4.2 Missing values

There are two types of null value:
    - None type (Python embeded object, can't be applied to any kinds of operation)
    - np.nan(NaN) (Float type, can be applied, but always return Nan)
    
   <font color = red > while in Pandas, None and np.nan are both seen as np.nan</font>

In [190]:
# object and float time efficency has great difference
%time np.arange(0,100000, dtype=object).sum()
%time np.arange(0,100000, dtype=float).sum()

CPU times: user 5.27 ms, sys: 162 s, total: 5.43 ms
Wall time: 5.42 ms

4999950000

CPU times: user 391 s, sys: 167 s, total: 558 s
Wall time: 355 s

4999950000.0

In [188]:
df = np.arange(1,100)

CPU times: user 452 s, sys: 397 s, total: 849 s
Wall time: 373 s

4999950000.0

In [191]:
df = pd.DataFrame.from_dict({
    'a':[1,0,0,0,0,0,0,0,0,0,np.nan],
    'b':[1,1,1,0,1,0,0,0,0,0,0],
    'c':[np.nan,0,0,np.nan,0,1,np.nan,np.nan,np.nan,0,0],
    'd':[1,2,3,4,5,6,7,8,9,10,np.nan],
    'e':[1,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,0,0,np.nan],
    'f':['np','python',0,'meanwhile',0,'what','that',0,0,'wordcount',np.nan]
})
df

      a  b    c     d    e          f
0   1.0  1  NaN   1.0  1.0         np
1   0.0  1  0.0   2.0  NaN     python
2   0.0  1  0.0   3.0  NaN          0
3   0.0  0  NaN   4.0  NaN  meanwhile
4   0.0  1  0.0   5.0  NaN          0
5   0.0  0  1.0   6.0  NaN       what
6   0.0  0  NaN   7.0  NaN       that
7   0.0  0  NaN   8.0  NaN          0
8   0.0  0  NaN   9.0  0.0          0
9   0.0  0  0.0  10.0  0.0  wordcount
10  NaN  0  0.0   NaN  NaN        NaN

In [192]:
df.isnull()

        a      b      c      d      e      f
0   False  False   True  False  False  False
1   False  False  False  False   True  False
2   False  False  False  False   True  False
3   False  False   True  False   True  False
4   False  False  False  False   True  False
5   False  False  False  False   True  False
6   False  False   True  False   True  False
7   False  False   True  False   True  False
8   False  False   True  False  False  False
9   False  False  False  False  False  False
10   True  False  False   True   True   True

In [197]:
S1 = df.isnull().any(axis=0) #row wise
S1
S2 = df.isnull().any(axis=1) # column wise
S2

a     True
b    False
c     True
d     True
e     True
f     True
dtype: bool

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9     False
10     True
dtype: bool

In [203]:
df[S2]
df[S1] #

      a  b    c    d    e          f
0   1.0  1  NaN  1.0  1.0         np
1   0.0  1  0.0  2.0  NaN     python
2   0.0  1  0.0  3.0  NaN          0
3   0.0  0  NaN  4.0  NaN  meanwhile
4   0.0  1  0.0  5.0  NaN          0
5   0.0  0  1.0  6.0  NaN       what
6   0.0  0  NaN  7.0  NaN       that
7   0.0  0  NaN  8.0  NaN          0
8   0.0  0  NaN  9.0  0.0          0
10  NaN  0  0.0  NaN  NaN        NaN

/Users/shanjiang/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match

In [205]:
df.dropna() # rowwise
df.dropna(axis=1) # columnwise

     a  b    c     d    e          f
9  0.0  0  0.0  10.0  0.0  wordcount

    b
0   1
1   1
2   1
3   0
4   1
5   0
6   0
7   0
8   0
9   0
10  0

In [206]:
df.dropna(how = 'all') # drop when all values are nan

      a  b    c     d    e          f
0   1.0  1  NaN   1.0  1.0         np
1   0.0  1  0.0   2.0  NaN     python
2   0.0  1  0.0   3.0  NaN          0
3   0.0  0  NaN   4.0  NaN  meanwhile
4   0.0  1  0.0   5.0  NaN          0
5   0.0  0  1.0   6.0  NaN       what
6   0.0  0  NaN   7.0  NaN       that
7   0.0  0  NaN   8.0  NaN          0
8   0.0  0  NaN   9.0  0.0          0
9   0.0  0  0.0  10.0  0.0  wordcount
10  NaN  0  0.0   NaN  NaN        NaN

In [209]:
df.fillna(value='999999') 
df

         a  b       c       d       e          f
0        1  1  999999       1       1         np
1        0  1       0       2  999999     python
2        0  1       0       3  999999          0
3        0  0  999999       4  999999  meanwhile
4        0  1       0       5  999999          0
5        0  0       1       6  999999       what
6        0  0  999999       7  999999       that
7        0  0  999999       8  999999          0
8        0  0  999999       9       0          0
9        0  0       0      10       0  wordcount
10  999999  0       0  999999  999999     999999

      a  b    c     d    e          f
0   1.0  1  NaN   1.0  1.0         np
1   0.0  1  0.0   2.0  NaN     python
2   0.0  1  0.0   3.0  NaN          0
3   0.0  0  NaN   4.0  NaN  meanwhile
4   0.0  1  0.0   5.0  NaN          0
5   0.0  0  1.0   6.0  NaN       what
6   0.0  0  NaN   7.0  NaN       that
7   0.0  0  NaN   8.0  NaN          0
8   0.0  0  NaN   9.0  0.0          0
9   0.0  0  0.0  10.0  0.0  wordcount
10  NaN  0  0.0   NaN  NaN        NaN

In [210]:
df.fillna(value='999999', inplace = True)
df

         a  b       c       d       e          f
0        1  1  999999       1       1         np
1        0  1       0       2  999999     python
2        0  1       0       3  999999          0
3        0  0  999999       4  999999  meanwhile
4        0  1       0       5  999999          0
5        0  0       1       6  999999       what
6        0  0  999999       7  999999       that
7        0  0  999999       8  999999          0
8        0  0  999999       9       0          0
9        0  0       0      10       0  wordcount
10  999999  0       0  999999  999999     999999

#### 2.4.3 stack and unstack

In [290]:
df = DataFrame(np.random.randint(50,100,48).reshape(4,12),
               columns=pd.MultiIndex.from_product([['student1','student2','student3'],['cs229','cs224'],['midterm','final']]),
               index = ["Spring",'Summer','Autumn','Winter'])
df

       student1                     student2                     student3  \
          cs229         cs224          cs229         cs224          cs229
        midterm final midterm final  midterm final midterm final  midterm
Spring       86    55      83    67       86    80      98    80       61
Summer       64    53      94    75       63    77      74    62       59
Autumn       82    62      98    50       89    75      74    97       60
Winter       85    83      85    71       87    94      69    77       58


               cs224
       final midterm final
Spring    75      53    57
Summer    75      66    74
Autumn    76      70    61
Winter    96      85    83

In [291]:
# stack can stack column into row
df.stack(level = 0)
df.stack(level = 1)
df.stack(level = 2)

                cs224         cs229
                final midterm final midterm
Spring student1    67      83    55      86
       student2    80      98    80      86
       student3    57      53    75      61
Summer student1    75      94    53      64
       student2    62      74    77      63
       student3    74      66    75      59
Autumn student1    50      98    62      82
       student2    97      74    75      89
       student3    61      70    76      60
Winter student1    71      85    83      85
       student2    77      69    94      87
       student3    83      85    96      58

             student1         student2         student3
                final midterm    final midterm    final midterm
Spring cs224       67      83       80      98       57      53
       cs229       55      86       80      86       75      61
Summer cs224       75      94       62      74       74      66
       cs229       53      64       77      63       75      59
Autumn cs224       50      98       97      74       61      70
       cs229       62      82       75      89       76      60
Winter cs224       71      85       77      69       83      85
       cs229       83      85       94      87       96      58

               student1       student2       student3
                  cs224 cs229    cs224 cs229    cs224 cs229
Spring final         67    55       80    80       57    75
       midterm       83    86       98    86       53    61
Summer final         75    53       62    77       74    75
       midterm       94    64       74    63       66    59
Autumn final         50    62       97    75       61    76
       midterm       98    82       74    89       70    60
Winter final         71    83       77    94       83    96
       midterm       85    85       69    87       85    58

In [296]:
df = df.T
df

                        Spring  Summer  Autumn  Winter
student1 cs229 midterm      86      64      82      85
               final        55      53      62      83
         cs224 midterm      83      94      98      85
               final        67      75      50      71
student2 cs229 midterm      86      63      89      87
               final        80      77      75      94
         cs224 midterm      98      74      74      69
               final        80      62      97      77
student3 cs229 midterm      61      59      60      58
               final        75      75      76      96
         cs224 midterm      53      66      70      85
               final        57      74      61      83

In [298]:
# unstack can rewind the row into column
df.unstack(level = 0)
df.unstack(level = 1)
df.unstack(level = 2)

                Spring                     Summer                     Autumn  \
              student1 student2 student3 student1 student2 student3 student1
cs224 final         67       80       57       75       62       74       50
      midterm       83       98       53       94       74       66       98
cs229 final         55       80       75       53       77       75       62
      midterm       86       86       61       64       63       59       82

                                  Winter
              student2 student3 student1 student2 student3
cs224 final         97       61       71       77       83
      midterm       74       70       85       69       85
cs229 final         75       76       83       94       96
      midterm       89       60       85       87       58

                 Spring       Summer       Autumn       Winter
                  cs224 cs229  cs224 cs229  cs224 cs229  cs224 cs229
student1 final       67    55     75    53     50    62     71    83
         midterm     83    86     94    64     98    82     85    85
student2 final       80    80     62    77     97    75     77    94
         midterm     98    86     74    63     74    89     69    87
student3 final       57    75     74    75     61    76     83    96
         midterm     53    61     66    59     70    60     85    58

               Spring         Summer         Autumn         Winter
                final midterm  final midterm  final midterm  final midterm
student1 cs224     67      83     75      94     50      98     71      85
         cs229     55      86     53      64     62      82     83      85
student2 cs224     80      98     62      74     97      74     77      69
         cs229     80      86     77      63     75      89     94      87
student3 cs224     57      53     74      66     61      70     83      85
         cs229     75      61     75      59     76      60     96      58

#### 2.4.4 aggregation

  * count
  * mean
  * sum
  * custom function

In [299]:
df5

       student1                     student2                     student3  \
          cs229         cs224          cs229         cs224          cs229
        midterm final midterm final  midterm final midterm final  midterm
Spring       84    64      79    76       50    50      95    88       84
Summer       65    81      59    92       82    70      97    77       92
Autumn       52    77      55    63       67    72      97    81       63
Winter       91    65      96    65       73    67      77    89       91


               cs224
       final midterm final
Spring    56      71    91
Summer    80      66    75
Autumn    54      59    74
Winter    83      81    64

In [301]:
df5.sum(axis = 0)
df5.sum(axis = 1)

student1  cs229  midterm    292
                 final      287
          cs224  midterm    289
                 final      296
student2  cs229  midterm    272
                 final      259
          cs224  midterm    366
                 final      335
student3  cs229  midterm    330
                 final      273
          cs224  midterm    277
                 final      304
dtype: int64

Spring    888
Summer    936
Autumn    814
Winter    942
dtype: int64

In [264]:
135+33+263

431